Kim-J-Smith/STM32-SimpleButton/Simple_Button.h
// struct for public method.
typedef struct simpleButton_Type_ButtonMethod_t {

    simpleButton_Type_AsynchronousHandler_t asynchronousHandler;

    simpleButton_Type_InterruptHandler_t interruptHandler;

} simpleButton_Type_ButtonMethod_t;

/**
 * @struct      simpleButton_Type_Button_t
 * 
 * @brief       This struct record the button status and config.
 *              User should not change the value in "Private" section,
 *              unless you know what you are doing.
 */
typedef struct simpleButton_Type_Button_t {

    simpleButton_Type_ButtonMethod_t Methods;

    simpleButton_Type_PublicBtnStatus_t Public;

    simpleButton_Type_PrivateBtnStatus_t Private;

} simpleButton_Type_Button_t;


/**
 * @brief           Initialize the status and config of button object.
 * 
 * @param[inout]    self - Pointer to the button object.
 * @param[in]       GPIOX_BASE - The base address of the GPIO port 
 *                  connected to the button.
 * @param[in]       asynchronousHandler - Function pointer of asynchronous handler.
 * @param[in]       interruptHandler - Function pointer of interrupt handler.
 * 
 * @return          None
 */
SIMPLEBTN_FORCE_INLINE void simpleButton_Private_InitStruct(
    simpleButton_Type_Button_t* self,
    simpleButton_Type_AsynchronousHandler_t asynchronousHandler,
    simpleButton_Type_InterruptHandler_t interruptHandler
) {
    SIMPLEBTN_FUNC_CRITICAL_SECTION_BEGIN();

    /* Initialize the member variables and method */
    self->Private.push_time = 0;
    self->Private.state = simpleButton_State_Wait_For_Interrupt;
    self->Private.timeStamp_interrupt = 0;
    self->Private.timeStamp_loop = 0;

    self->Methods.asynchronousHandler = asynchronousHandler;
    self->Methods.interruptHandler = interruptHandler;

#if SIMPLEBTN_MODE_ENABLE_ONLY_DEFAULT_TIME == 0
    self->Public.coolDownTime = SIMPLEBTN_TIME_COOL_DOWN;
    self->Public.longPushMinTime = SIMPLEBTN_TIME_LONG_PUSH_MIN;
    self->Public.repeatWindowTime = SIMPLEBTN_TIME_REPEAT_WINDOW;
 #if SIMPLEBTN_MODE_ENABLE_LONGPUSH_HOLD != 0
    self->Public.holdPushMinTime = SIMPLEBTN_TIME_HOLD_PUSH_MIN;
 #endif /* SIMPLEBTN_MODE_ENABLE_LONGPUSH_HOLD != 0 */
#endif /* SIMPLEBTN_MODE_ENABLE_ONLY_DEFAULT_TIME == 0 */

#if SIMPLEBTN_MODE_ENABLE_COMBINATION != 0
    self->Public.combinationConfig.previousButton = 0;
    self->Public.combinationConfig.callBack = 0;
#endif /* SIMPLEBTN_MODE_ENABLE_COMBINATION != 0 */

    SIMPLEBTN_FUNC_CRITICAL_SECTION_END();
}

/**
 * @brief           Initilize the button.
 * 
 * @param[inout]    self - Pointer to the button object.
 * @param[in]       GPIOX_BASE - The base address of the GPIO port 
 *                  connected to the button.
 * @param[in]       GPIO_Pin_X - The GPIO Pin number connected to the button.
 * @param[in]       EXTI_Trigger_X - The EXTI Trigger of the Pin.
 * @param[in]       asynchronousHandler - Function pointer of asynchronous handler.
 * @param[in]       interruptHandler - Function pointer of interrupt handler.
 * 
 * @return          None
 */
SIMPLEBTN_FORCE_INLINE void simpleButton_Private_InitButton(
    simpleButton_Type_Button_t* self,
    simpleButton_Type_GPIOBase_t GPIOX_BASE,
    simpleButton_Type_GPIOPin_t GPIO_Pin_X,
    simpleButton_Type_EXTITrigger_t EXTI_Trigger_X,
    simpleButton_Type_AsynchronousHandler_t asynchronousHandler,
    simpleButton_Type_InterruptHandler_t interruptHandler
) {

    simpleButton_Private_InitStruct(
        self,
        asynchronousHandler,
        interruptHandler
    );

    simpleButton_Private_InitEXTI(
        GPIOX_BASE,
        GPIO_Pin_X,
        EXTI_Trigger_X
    );

}

/**
 * @brief           Change the status of each button when during the EXTI interrupt
 *                  service routine.
 * 
 * @return          None
 */
SIMPLEBTN_FORCE_INLINE void simpleButton_Private_InterruptHandler(
    simpleButton_Type_Button_t* self
) {
    if (
        (simpleButton_Type_ButtonState_t)(self->Private.state) == simpleButton_State_Wait_For_Interrupt
        || (simpleButton_Type_ButtonState_t)(self->Private.state) == simpleButton_State_Wait_For_Repeat
    ) {
        self->Private.timeStamp_interrupt = SIMPLEBTN_FUNC_GET_TICK();
        self->Private.state = simpleButton_State_Push_Delay;
    }
}

SIMPLEBTN_FORCE_INLINE void
simpleButton_Private_StateWaitForInterrupt_Handler(void) {
    /* Do nothing */
}

SIMPLEBTN_FORCE_INLINE void
simpleButton_Private_StatePushDelay_Handler(
    simpleButton_Type_Button_t* const self,
    const simpleButton_Type_GPIOBase_t gpiox_base,
    const simpleButton_Type_GPIOPin_t  gpio_pin_x,
    const simpleButton_Type_GPIOPinVal_t normal_pin_val
) {
    if (SIMPLEBTN_FUNC_GET_TICK() - self->Private.timeStamp_interrupt <= SIMPLEBTN_TIME_PUSH_DELAY) {
        return; /* still need wait */
    }

    if (SIMPLEBTN_FUNC_READ_PIN(gpiox_base, gpio_pin_x) != normal_pin_val) {
        self->Private.state = simpleButton_State_Wait_For_End;
    } else {
        if (self->Private.push_time == 0) {
            self->Private.state = simpleButton_State_Wait_For_Interrupt;
        } else {
            self->Private.state = simpleButton_State_Wait_For_Repeat;
        }
    }
}

SIMPLEBTN_FORCE_INLINE void
simpleButton_Private_StateWaitForEnd_Handler(
    simpleButton_Type_Button_t* const self,
    const simpleButton_Type_GPIOBase_t gpiox_base,
    const simpleButton_Type_GPIOPin_t  gpio_pin_x,
    const simpleButton_Type_GPIOPinVal_t normal_pin_val
) {
    if (SIMPLEBTN_FUNC_READ_PIN(gpiox_base, gpio_pin_x) == normal_pin_val) {
        self->Private.timeStamp_loop = SIMPLEBTN_FUNC_GET_TICK();
        self->Private.state = simpleButton_State_Release_Delay;
    } 
#if SIMPLEBTN_MODE_ENABLE_LONGPUSH_HOLD != 0
 #if SIMPLEBTN_MODE_ENABLE_ONLY_DEFAULT_TIME != 0
    else if (SIMPLEBTN_FUNC_GET_TICK() - self->Private.timeStamp_interrupt > SIMPLEBTN_TIME_HOLD_PUSH_MIN)
 #else
    else if (SIMPLEBTN_FUNC_GET_TICK() - self->Private.timeStamp_interrupt > self->Public.holdPushMinTime)
 #endif /* SIMPLEBTN_MODE_ENABLE_ONLY_DEFAULT_TIME != 0 */
    {
        self->Private.timeStamp_loop = SIMPLEBTN_FUNC_GET_TICK();
        self->Private.state = simpleButton_State_Hold_Push;
    }
#endif /* SIMPLEBTN_MODE_ENABLE_LONGPUSH_HOLD != 0 */
    else if (SIMPLEBTN_FUNC_GET_TICK() - self->Private.timeStamp_interrupt > SIMPLEBTN_TIME__TIMEOUT_NORMAL) {

