Kim-J-Smith/STM32-SimpleButton/Simple_Button.h
#if defined(SIMPLEBTN_DEBUG)
        SIMPLEBTN_FUNC_PANIC("normal long push time out", , );
#else
        self->Private.push_time = 0;
        self->Private.state = simpleButton_State_Wait_For_Interrupt;
#endif /* defined(SIMPLEBTN_DEBUG) */

    }
}

SIMPLEBTN_FORCE_INLINE void
simpleButton_Private_StateWaitForRepeat_Handler(
    simpleButton_Type_Button_t* const self
) {
    SIMPLEBTN_FUNC_CRITICAL_SECTION_END_M(); /* end multi-thread critical section */
    SIMPLEBTN_FUNC_CRITICAL_SECTION_BEGIN(); /* begin always critical section */

#if SIMPLEBTN_MODE_ENABLE_ONLY_DEFAULT_TIME == 0
    if (SIMPLEBTN_FUNC_GET_TICK() - self->Private.timeStamp_loop > (uint32_t)self->Public.repeatWindowTime)
#else
    if (SIMPLEBTN_FUNC_GET_TICK() - self->Private.timeStamp_loop > SIMPLEBTN_TIME_REPEAT_WINDOW)
#endif /* SIMPLEBTN_MODE_ENABLE_ONLY_DEFAULT_TIME == 0 */
    {

#if SIMPLEBTN_MODE_ENABLE_COUNTER_REPEAT_PUSH == 0
        self->Private.state = simpleButton_State_Single_Push;
#else
        if (self->Private.push_time == 1) {
            self->Private.state = simpleButton_State_Single_Push;
        } else {
            self->Private.state = simpleButton_State_Repeat_Push;
        }
#endif /* SIMPLEBTN_MODE_ENABLE_COUNTER_REPEAT_PUSH == 0 */

    } // end if

    SIMPLEBTN_FUNC_CRITICAL_SECTION_END(); /* end always critical section */
    SIMPLEBTN_FUNC_CRITICAL_SECTION_BEGIN_M(); /* begin multi-thread critical section */
}

// a helper function
SIMPLEBTN_FORCE_INLINE void
simpleButton_Private_Do_LongPush(
    simpleButton_Type_Button_t* const self,
    simpleButton_Type_LongPushCallBack_t longPushCallBack
) {

#if SIMPLEBTN_MODE_ENABLE_TIMER_LONG_PUSH == 0
    (void)self;
    SIMPLEBTN_FUNC_CRITICAL_SECTION_END_M(); /* end multi-thread critical section */
    if (longPushCallBack != 0) {
        longPushCallBack();
    }
    SIMPLEBTN_FUNC_CRITICAL_SECTION_BEGIN_M(); /* begin multi-thread critical section */
#else
    uint32_t longPushTime = SIMPLEBTN_FUNC_GET_TICK() - self->Private.timeStamp_interrupt;
    SIMPLEBTN_FUNC_CRITICAL_SECTION_END_M(); /* end multi-thread critical section */
    if (longPushCallBack != 0) {
        longPushCallBack(longPushTime);
    }
    SIMPLEBTN_FUNC_CRITICAL_SECTION_BEGIN_M(); /* begin multi-thread critical section */
#endif /* SIMPLEBTN_MODE_ENABLE_TIMER_LONG_PUSH == 0 */

}

SIMPLEBTN_FORCE_INLINE void
simpleButton_Private_Do_ShortPush(
    simpleButton_Type_ShortPushCallBack_t shortPushCallBack
) {
    SIMPLEBTN_FUNC_CRITICAL_SECTION_END_M(); /* end multi-thread critical section */
    if (shortPushCallBack != 0) {
        shortPushCallBack();
    }
    SIMPLEBTN_FUNC_CRITICAL_SECTION_BEGIN_M(); /* begin multi-thread critical section */
}

SIMPLEBTN_FORCE_INLINE void
simpleButton_Private_StateSinglePush_Handler(
    simpleButton_Type_Button_t* const self,
    simpleButton_Type_ShortPushCallBack_t shortPushCallBack,
    simpleButton_Type_LongPushCallBack_t longPushCallBack
) {
    
#if SIMPLEBTN_MODE_ENABLE_ONLY_DEFAULT_TIME == 0
    if (SIMPLEBTN_FUNC_GET_TICK() - self->Private.timeStamp_interrupt > (uint32_t)self->Public.longPushMinTime)
#else
    if (SIMPLEBTN_FUNC_GET_TICK() - self->Private.timeStamp_interrupt > SIMPLEBTN_TIME_LONG_PUSH_MIN)
#endif /* SIMPLEBTN_MODE_ENABLE_ONLY_DEFAULT_TIME == 0 */
    {
        simpleButton_Private_Do_LongPush(self, longPushCallBack);
    } else {
        simpleButton_Private_Do_ShortPush(shortPushCallBack);
    }

    self->Private.push_time = 0;
    self->Private.timeStamp_loop = SIMPLEBTN_FUNC_GET_TICK();
    self->Private.state = simpleButton_State_Cool_Down;
}

SIMPLEBTN_FORCE_INLINE void
simpleButton_Private_StateRepeatPush_Handler(
    simpleButton_Type_Button_t* const self,
    simpleButton_Type_RepeatPushCallBack_t repeatPushCallBack
) {
    SIMPLEBTN_FUNC_CRITICAL_SECTION_END_M(); /* end multi-thread critical section */

    if (repeatPushCallBack != 0) {

#if SIMPLEBTN_MODE_ENABLE_COUNTER_REPEAT_PUSH == 0
        repeatPushCallBack();
#else
        repeatPushCallBack(self->Private.push_time);
#endif /* SIMPLEBTN_MODE_ENABLE_COUNTER_REPEAT_PUSH == 0 */

    } // end if

    SIMPLEBTN_FUNC_CRITICAL_SECTION_BEGIN_M(); /* begin multi-thread critical section */
    self->Private.push_time = 0;
    self->Private.timeStamp_loop = SIMPLEBTN_FUNC_GET_TICK();
    self->Private.state = simpleButton_State_Cool_Down;
}

// a helper function
SIMPLEBTN_FORCE_INLINE void
simpleButton_Private_CmbBtnAfterReleaseOK(
    simpleButton_Type_Button_t* const self
) {
#if SIMPLEBTN_MODE_ENABLE_COMBINATION != 0

    if (self->Public.combinationConfig.callBack == 0 || self->Public.combinationConfig.previousButton == 0) {
        return; /* user didn't use combination button */
    }

    /* prev-button should be [Combination]_WaitForEnd. */
    if (self->Public.combinationConfig.previousButton->Private.state != simpleButton_State_Combination_WaitForEnd) {
        if (self->Public.combinationConfig.previousButton->Private.state != simpleButton_State_Wait_For_End) {
            return; /* prev-button isn't [Combination]_WaitForEnd. */
        } else {
            self->Public.combinationConfig.previousButton->Private.state = simpleButton_State_Combination_WaitForEnd;
        }
    }

    self->Private.state = simpleButton_State_Combination_Push;

#endif /* SIMPLEBTN_MODE_ENABLE_COMBINATION != 0 */
}

// a helper function
SIMPLEBTN_FORCE_INLINE void
simpleButton_Private_ReleaseOK(
    simpleButton_Type_Button_t* const self
) {
    self->Private.push_time ++;
    self->Private.timeStamp_loop = SIMPLEBTN_FUNC_GET_TICK();

    /* enable counter-repeat-push or not */
#if SIMPLEBTN_MODE_ENABLE_COUNTER_REPEAT_PUSH == 0
    self->Private.state = (self->Private.push_time == 1)
        ? simpleButton_State_Wait_For_Repeat : simpleButton_State_Repeat_Push;
#else
    self->Private.state = (self->Private.push_time < 0xFF)
        ? simpleButton_State_Wait_For_Repeat : simpleButton_State_Repeat_Push;
#endif /* SIMPLEBTN_MODE_ENABLE_COUNTER_REPEAT_PUSH == 0 */

    simpleButton_Private_CmbBtnAfterReleaseOK(self);
}


