Kim-J-Smith/STM32-SimpleButton/Simple_Button.h
SIMPLEBTN_FORCE_INLINE void
simpleButton_Private_StateReleaseDelay_Handler(
    simpleButton_Type_Button_t* const self,
    const simpleButton_Type_GPIOBase_t gpiox_base,
    const simpleButton_Type_GPIOPin_t  gpio_pin_x,
    const simpleButton_Type_GPIOPinVal_t normal_pin_val
) {
    if (SIMPLEBTN_FUNC_GET_TICK() - self->Private.timeStamp_loop <= SIMPLEBTN_TIME_RELEASE_DELAY) {
        return; /* still need wait */
    }

    if (SIMPLEBTN_FUNC_READ_PIN(gpiox_base, gpio_pin_x) == normal_pin_val) {
        simpleButton_Private_ReleaseOK(self);
    } else {
        self->Private.state = simpleButton_State_Wait_For_End;
    }
}

SIMPLEBTN_FORCE_INLINE void
simpleButton_Private_StateCoolDown_Handler(
    simpleButton_Type_Button_t* const self
) {
#if SIMPLEBTN_MODE_ENABLE_ONLY_DEFAULT_TIME == 0
    if (SIMPLEBTN_FUNC_GET_TICK() - self->Private.timeStamp_loop > self->Public.coolDownTime)
#else
    if (SIMPLEBTN_FUNC_GET_TICK() - self->Private.timeStamp_loop > SIMPLEBTN_TIME_COOL_DOWN)
#endif /* SIMPLEBTN_MODE_ENABLE_ONLY_DEFAULT_TIME == 0 */
    {
        self->Private.state = simpleButton_State_Wait_For_Interrupt;
    }

}

#if SIMPLEBTN_MODE_ENABLE_COMBINATION != 0
SIMPLEBTN_FORCE_INLINE void
simpleButton_Private_StateCombinationPush_Handler(
    simpleButton_Type_Button_t* const self
) {
    simpleButton_Type_CombinationPushCallBack_t cmbCallBack;
    cmbCallBack = self->Public.combinationConfig.callBack;

    SIMPLEBTN_FUNC_CRITICAL_SECTION_END_M(); /* end multi-thread critical section */

    if (cmbCallBack != 0) {
        cmbCallBack();
    }

    SIMPLEBTN_FUNC_CRITICAL_SECTION_BEGIN_M(); /* begin multi-thread critical section */
    self->Private.push_time = 0;
    self->Private.timeStamp_loop = SIMPLEBTN_FUNC_GET_TICK();
    self->Private.state = simpleButton_State_Cool_Down;
}

SIMPLEBTN_FORCE_INLINE void
simpleButton_Private_StateCombinationWaitForEnd_Handler(
    simpleButton_Type_Button_t* const self,
    const simpleButton_Type_GPIOBase_t gpiox_base,
    const simpleButton_Type_GPIOPin_t  gpio_pin_x,
    const simpleButton_Type_GPIOPinVal_t normal_pin_val
) {
    if (SIMPLEBTN_FUNC_READ_PIN(gpiox_base, gpio_pin_x) == normal_pin_val) {
        self->Private.state = simpleButton_State_Combination_Release;
    } else if (SIMPLEBTN_FUNC_GET_TICK() - self->Private.timeStamp_interrupt > SIMPLEBTN_TIME__TIMEOUT_COMBINATION) {

#if defined(SIMPLEBTN_DEBUG)
        SIMPLEBTN_FUNC_PANIC("combination long push time out", , );
#else
        self->Private.push_time = 0;
        self->Private.state = simpleButton_State_Wait_For_Interrupt;
#endif /* defined(SIMPLEBTN_DEBUG) */

    }
}

SIMPLEBTN_FORCE_INLINE void
simpleButton_Private_StateCombinationRelease_Handler(
    simpleButton_Type_Button_t* const self,
    const simpleButton_Type_GPIOBase_t gpiox_base,
    const simpleButton_Type_GPIOPin_t  gpio_pin_x,
    const simpleButton_Type_GPIOPinVal_t normal_pin_val
) {
    if (SIMPLEBTN_FUNC_GET_TICK() - self->Private.timeStamp_loop <= SIMPLEBTN_TIME_RELEASE_DELAY) {
        return; /* still need wait */
    }

    if (SIMPLEBTN_FUNC_READ_PIN(gpiox_base, gpio_pin_x) == normal_pin_val) {
        self->Private.push_time = 0;
        self->Private.timeStamp_loop = SIMPLEBTN_FUNC_GET_TICK();
        self->Private.state = simpleButton_State_Cool_Down;
    } else {
        self->Private.state = simpleButton_State_Combination_WaitForEnd;
    }
}

#endif /* SIMPLEBTN_MODE_ENABLE_COMBINATION != 0 */


#if SIMPLEBTN_MODE_ENABLE_LONGPUSH_HOLD != 0

SIMPLEBTN_FORCE_INLINE void
simpleButton_Private_StateHoldPush_Handler(
    simpleButton_Type_Button_t* const self,
    const simpleButton_Type_GPIOBase_t gpiox_base,
    const simpleButton_Type_GPIOPin_t  gpio_pin_x,
    const simpleButton_Type_GPIOPinVal_t normal_pin_val,
    const simpleButton_Type_LongPushCallBack_t longPushCallBack
) {
    if (SIMPLEBTN_FUNC_READ_PIN(gpiox_base, gpio_pin_x) == normal_pin_val) {
        self->Private.timeStamp_loop = SIMPLEBTN_FUNC_GET_TICK();
        self->Private.state = simpleButton_State_Hold_Release;
    }

    if (SIMPLEBTN_FUNC_GET_TICK() - self->Private.timeStamp_loop > SIMPLEBTN_TIME_HOLD_INTERVAL) {
        simpleButton_Private_Do_LongPush(self, longPushCallBack);
        self->Private.timeStamp_loop = SIMPLEBTN_FUNC_GET_TICK();
    }
}

SIMPLEBTN_FORCE_INLINE void
simpleButton_Private_StateHoldRelease_Handler(
    simpleButton_Type_Button_t* const self,
    const simpleButton_Type_GPIOBase_t gpiox_base,
    const simpleButton_Type_GPIOPin_t  gpio_pin_x,
    const simpleButton_Type_GPIOPinVal_t normal_pin_val
) {
    if (SIMPLEBTN_FUNC_GET_TICK() - self->Private.timeStamp_loop <= SIMPLEBTN_TIME_RELEASE_DELAY) {
        return; /* still need wait */
    }

    if (SIMPLEBTN_FUNC_READ_PIN(gpiox_base, gpio_pin_x) == normal_pin_val) {
        self->Private.push_time = 0;
        self->Private.timeStamp_loop = SIMPLEBTN_FUNC_GET_TICK();
        self->Private.state = simpleButton_State_Cool_Down;
    } else {
        self->Private.state = simpleButton_State_Hold_Push;
    }
}

#endif /* SIMPLEBTN_MODE_ENABLE_LONGPUSH_HOLD != 0 */


SIMPLEBTN_FORCE_INLINE void
simpleButton_Private_StateDefault_Handler(
    simpleButton_Type_Button_t* const self
) {

#if defined(SIMPLEBTN_DEBUG)
    (void)self;
    SIMPLEBTN_FUNC_PANIC("invalid button state", , );
#else
    self->Private.push_time = 0;
    self->Private.state = simpleButton_State_Wait_For_Interrupt;
#endif /* defined(SIMPLEBTN_DEBUG) */

}

/**
 * @brief           Asynchronously call the callback function in while loop.
 * @param[inout]    self - pointer to self struct.
 * @param[in]       gpiox_base - Address of GPIO port connected to the button.
 * @param[in]       gpio_pin_x - GPIO pin number connected to the button.
 * @param[in]       normal_pin_val - Normal(didn't push) pin value of button pin. (can be 1 or 0)
 * @param[in]       shortPushCB - callback function for short push.
 * @param[in]       longPushCB - callback function for long push.
 * @param[in]       repeatPushCB - callback function for repeat push.
 * @return          None
 */
SIMPLEBTN_SUGGEST_INLINE void
simpleButton_Private_AsynchronousHandler(
    simpleButton_Type_Button_t* const self,
    const simpleButton_Type_GPIOBase_t gpiox_base,
    const simpleButton_Type_GPIOPin_t  gpio_pin_x,
    const simpleButton_Type_GPIOPinVal_t normal_pin_val,
    simpleButton_Type_ShortPushCallBack_t shortPushCB,
    simpleButton_Type_LongPushCallBack_t longPushCB,
    simpleButton_Type_RepeatPushCallBack_t repeatPushCB
) {
    SIMPLEBTN_FUNC_CRITICAL_SECTION_BEGIN_M(); /* begin multi-thread critical section */

    switch ( (simpleButton_Type_ButtonState_t)(self->Private.state) ) {
    case simpleButton_State_Wait_For_Interrupt: {
        simpleButton_Private_StateWaitForInterrupt_Handler();
        break;
    }

