Kim-J-Smith/STM32-SimpleButton/Simple_Button.h
#endif /* >= C99 or C++11 */


/**
 * @def         SIMPLEBTN__CREATE
 * @brief       Creat a button.
 * @param[in]   GPIOx_BASE - The address of GPIO port connected to button.
 * @param[in]   GPIO_Pin_x - The number of the GPIO pin connected to button.
 * @param[in]   EXTI_Trigger_x - The EXTI trigger.
 * @param[in]   __name - The name of the button.
 * @attention   EXTI_Trigger_x must choose between Raising and Falling.
 */
#define SIMPLEBTN__CREATE(GPIOx_BASE, GPIO_Pin_x, EXTI_Trigger_x, __name)       \
    simpleButton_Type_Button_t                                                  \
    SIMPLEBTN_CONNECT2(SIMPLEBTN_NAMESPACE, __name) = {0};                      \
                                                                                \
    static void                                                                 \
    SIMPLEBTN_CONNECT2(simpleButton_Private_AsyHandler_, __name)(               \
        simpleButton_Type_ShortPushCallBack_t  shortPushCallBack,               \
        simpleButton_Type_LongPushCallBack_t   longPushCallBack,                \
        simpleButton_Type_RepeatPushCallBack_t repeatPushCallBack               \
    ) {                                                                         \
        const simpleButton_Type_GPIOPinVal_t normalPinVal =                     \
            (simpleButton_Type_GPIOPinVal_t)                                    \
            (((EXTI_Trigger_x) == SIMPLEBTN_EXTI_TRIGGER_FALLING) ? 1 : 0);     \
                                                                                \
        simpleButton_Private_AsynchronousHandler(                               \
            &(SIMPLEBTN_CONNECT2(SIMPLEBTN_NAMESPACE, __name)),                 \
            (GPIOx_BASE),                                                       \
            (GPIO_Pin_x),                                                       \
            normalPinVal,                                                       \
            shortPushCallBack,                                                  \
            longPushCallBack,                                                   \
            repeatPushCallBack                                                  \
        );                                                                      \
    }                                                                           \
                                                                                \
    static void                                                                 \
    SIMPLEBTN_CONNECT2(simpleButton_Private_ITHandler_, __name)(void) {         \
        simpleButton_Private_InterruptHandler(                                  \
            &(SIMPLEBTN_CONNECT2(SIMPLEBTN_NAMESPACE, __name))                  \
        );                                                                      \
    }                                                                           \
                                                                                \
    SIMPLEBTN_C_API void                                                        \
    SIMPLEBTN_CONNECT3(SIMPLEBTN_NAMESPACE, __name, _Init)(void) {              \
        simpleButton_Private_InitButton(                                        \
            &(SIMPLEBTN_CONNECT2(SIMPLEBTN_NAMESPACE, __name)),                 \
            (GPIOx_BASE),                                                       \
            (GPIO_Pin_x),                                                       \
            (EXTI_Trigger_x),                                                   \
            &(SIMPLEBTN_CONNECT2(simpleButton_Private_AsyHandler_, __name)),    \
            &(SIMPLEBTN_CONNECT2(simpleButton_Private_ITHandler_, __name))      \
        );                                                                      \
    }


/**
 * @def         SIMPLEBTN__DECLARE
 * @param[in]   __name - The name of button.
 * @attention   The name of button must be the same as it is when created.
 */
#define SIMPLEBTN__DECLARE(__name)                                              \
    extern simpleButton_Type_Button_t                                           \
    SIMPLEBTN_CONNECT2(SIMPLEBTN_NAMESPACE, __name);                            \
    SIMPLEBTN_C_API void                                                        \
    SIMPLEBTN_CONNECT3(SIMPLEBTN_NAMESPACE, __name, _Init)(void);


#endif /* SIMPLEBUTTON_H__ */
